---
kind: other
id: AllMembers.T:Autodesk.Revit.Exceptions.InvalidDataStreamException
source: html/dd5611d8-4670-b5da-a4d2-bf64f14c9fd9.htm
---
# InvalidDataStreamException Members

Retrieves data needed to serialize the target object.